Tekla Open API Reference for Tekla Structures 2025
CoordinateSystem Constructor
 Instantiates a coordinate system in the current work plane.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CoordinateSystem()
Public Sub New
See Also
Reference
CoordinateSystem Class
CoordinateSystem Overload
Tekla.Structures.Geometry3d Namespace